b_prediction_old/RANS_cases/2_pc_Re_tau_395/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        // Name of new patch
        name INLET;

        // Dictionary to construct new patch from
        patchInfo
        {
            type cyclic;
            neighbourPatch  OUTLET;
            matchTolerance  0.0001;                       
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        //patches (inlet outlet topAndBottom);

        // If constructFrom = set : name of faceSet
        patches (INLET);
    }

    {
        // Name of new patch
        name OUTLET;

        // Dictionary to construct new patch from
        patchInfo
        {
            type 	cyclic;
            neighbourPatch  INLET;
            matchTolerance  0.0001;                    
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        //patches (inlet outlet topAndBottom);

        // If constructFrom = set : name of faceSet
        patches (OUTLET);
    }
    
    {
        // Name of new patch
        name LOWER-WALL;

        // Dictionary to construct new patch from
        patchInfo
        {
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (wing);

        // If constructFrom = set : name of faceSet
        set LOWER-WALL;
    }
    {
        // Name of new patch
        name UPPER-WALL;

        // Dictionary to construct new patch from
        patchInfo
        {
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (wing);

        // If constructFrom = set : name of faceSet
        set UPPER-WALL;
    }
    {
        // Name of new patch
        name frontAndBackPlanes;

        // Dictionary to construct new patch from
        patchInfo
        {
            type empty;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom set;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (symFront symBack);

        // If constructFrom = set : name of faceSet
        set frontAndBackPlanes;
    }
);

// ************************************************************************* //
